# Capitalize first letter of a column in Pandas dataframe

First letter of  column in dataframe can be capitalized by using `capitalize()` method.

## How to capitalize first letter of a column in Pandas dataframe

In this article, article, you will learn how to capitalize the first word of a column using -

* Capitalize function
* lambda __+__ capitalize() function

Let's create a dataframe.

In [ ]:
# Importing library
import pandas as pd

# Create dataframe 
lst = [['duA lipa','F','don\'t start now'],['laDy gaga','F','just dance'],['jusTin bieber','M','what do you mean'],['tayLor swiFt','F','all too well'],
['shAwn meNdes','M','treat you better'],['seLena Gomez','F','come $ get it'], ['ed shEEran','M','thInKing out loud'],['bRuno mArs','M','the laZy song']]
    
Singer_df = pd.DataFrame(lst,columns=['Singer_Name','Gender','Song'])

Singer_df

     Singer_Name Gender               Song
0       duA lipa      F    don't start now
1      laDy gaga      F         just dance
2  jusTin bieber      M   what do you mean
3   tayLor swiFt      F       all too well
4   shAwn meNdes      M   treat you better
5   seLena Gomez      F      come $ get it
6     ed shEEran      M  thInKing out loud
7     bRuno mArs      M      the laZy song

## 1.Capitalize first letter of a column using `dataframe.str.capitalize()` method

Lets see the syntax of `Series.str.capitalize()` method.

### dataframe['Column_Name'].str.capitalize()

__Purpose:__ capitalize the first word of specified column.

__Returns:__ A series of objects with first character of a string in uppercase and all other characters in lowercase.

In [ ]:
# Capitalize first letter of a column in Pandas dataframe using capitalize() on Singer_Name column
Singer_df['Singer_Name']= Singer_df['Singer_Name'].str.capitalize()

Singer_df

     Singer_Name Gender               Song
0       Dua lipa      F    don't start now
1      Lady gaga      F         just dance
2  Justin bieber      M   what do you mean
3   Taylor swift      F       all too well
4   Shawn mendes      M   treat you better
5   Selena gomez      F      come $ get it
6     Ed sheeran      M  thInKing out loud
7     Bruno mars      M      the laZy song

You can see that after applying `capitalize()` on `Singer_Name` column, first letter of `Singer_Name` column got converted into uppercase and all other letters are converted to lowercase.

##2.Capitalize first letter of a column using lambda __+__ capitalize() method

Lets see the syntax for `capitalize()` method with lambda method.

### dataframe['Column_Name'].apply(lambda argument: argument.capitalize())

__Purpose:__ Used to make first word of column capital.

__Returns:__ Column with first letter of string in uppercase and other letters in lowercase.

In [ ]:
# Capitalizing first letter or every record from Song columns 
Singer_df['Song'] = Singer_df['Song'].apply(lambda A: A.capitalize())

Singer_df

     Singer_Name Gender               Song
0       Dua lipa      F    Don't start now
1      Lady gaga      F         Just dance
2  Justin bieber      M   What do you mean
3   Taylor swift      F       All too well
4   Shawn mendes      M   Treat you better
5   Selena gomez      F      Come $ get it
6     Ed sheeran      M  Thinking out loud
7     Bruno mars      M      The lazy song

You can see that after applying `capitalize()` with lambda function on Song column, first letter of Song column is converted into uppercase and all other letters are converted to lowercase.

## 3.Practical Tips

* Always use `str.capitalize()` while performing capitalize operation on a column.

* Ensure to store column data and overwrite it to the same column after performing `capitalize()` otherwise it will not reflect the original dataframe. 

* Ensure that you are applying `capitalize()` on a particular column.

## 4.Test Your Knowledge

__Q1.__ After applying `capitalize()` method on string ```'sInGeR'``` output will be ```'SInGeR'```. True or False?

__Ans.__ False. Output will be `'Singer'`, `capitalize()` return first character of a string in uppercase and all other characters in lowercase.



__Q2.__ What will be the output of following code ?

In [ ]:
import pandas as pd

l = [['duA lipa','25 milion'],['laDy gaga','320 milion'],['jusTin bieber','285 milion'],['tayLor swiFt','365 milion'],
['shAwn meNdes','40 milion'],['seLena Gomez','75 milion'], ['ed shEEran','200 milion'],['bRuno mArs','175 milion']]
    
df = pd.DataFrame(l, columns=['Singer_Name','Net_Worth(Dollars)'])
df = df.str.capitalize()

df

__Ans.__ `AttributeError` - 'DataFrame' object has no attribute 'str'. You need to specify column name.



__Q3.__ What will be the output of following code ?

In [ ]:
import pandas as pd

l = [['duA lipa','25 milion'],['laDy gaga','320 milion'],['jusTin bieber','285 milion'],['tayLor swiFt','365 milion'],
['shAwn meNdes','40 milion'],['seLena Gomez','75 milion'], ['ed shEEran','200 milion'],['bRuno mArs','175 milion']]
    
df = pd.DataFrame(l, columns=['Singer_Name','Net_Worth(Dollars)'])
df['Singer_Name'] = df['Singer_Name'].apply(lambda B: B.capitalize())

df

     Singer_Name Net_Worth(Dollars)
0       Dua lipa          25 milion
1      Lady gaga         320 milion
2  Justin bieber         285 milion
3   Taylor swift         365 milion
4   Shawn mendes          40 milion
5   Selena gomez          75 milion
6     Ed sheeran         200 milion
7     Bruno mars         175 milion

`Singer_Name` column's first letter gets capitalized.